# 문제 1: 가로 70cm, 높이 144cm의 삼각형이 있을 때, 빗변의 길이를 구하라

In [7]:
import math

In [8]:
a =70 #가로길이

In [9]:
b = 144 # 높이

In [10]:
print(a**2 )

4900

In [11]:
print(b**2)

20736

In [12]:
c = a**2 + b**2

In [13]:
print(math.sqrt(c))

160.11246047700348

# 문제 2: a = 55.994이고, b = 75일 때, a를 일의 자릿수까지 반올림한 숫자와, b의 절댓값 중 큰 것을 구하라

In [25]:
a = 55.994

In [26]:
b = 75

In [28]:
round(a, )

56

a < b 이므로 답은 b

# 문제 3: lorem의 400번째 자리 글자를 구하라

In [15]:
lorem = '''There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don't look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn't anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.'''

In [16]:
lorem[400]

'r'

In [19]:
lorem[0]

'T'

# 문제 4: lorem의 뒤에서 3번째부터 뒤에서 99번째까지의 글자를 구하라

In [71]:
lorem[-3:100: -1]

"te sdrow citsiretcarahc-non ro ,ruomuh detcejni ,noititeper morf eerf syawla erofereht si muspI meroL detareneg ehT .elbanosaer skool hcihw muspI meroL etareneg ot ,serutcurts ecnetnes ledom fo lufdnah a htiw denibmoc ,sdrow nitaL 002 revo fo yranoitcid a sesu tI .tenretnI eht no rotareneg eurt tsrif eht siht gnikam ,yrassecen sa sknuhc denifederp taeper ot dnet tenretnI eht no srotareneg muspI meroL eht llA .txet fo elddim eht ni neddih gnissarrabme gnihtyna t'nsi ereht erus eb ot deen uoy ,muspI meroL fo egassap a esu ot gniog era uoy fI .elbaveileb ylthgils neve kool t'nod hcihw sdrow desimodnar ro ,ruomuh detcejni yb ,mrof emos ni noit"

# 문제 5: lorem의 글자 중 27번째 글자를 대문자로 바꾸어라

In [50]:
lorem[27].upper()

'F'

# 문제 6: lorem의 띄어쓰기를 제거해 lorem2 변수로 저장하라

In [55]:
lorem2 = lorem.replace(' ','')

In [56]:
print(lorem2)

TherearemanyvariationsofpassagesofLoremIpsumavailable,butthemajorityhavesufferedalterationinsomeform,byinjectedhumour,orrandomisedwordswhichdon'tlookevenslightlybelievable.IfyouaregoingtouseapassageofLoremIpsum,youneedtobesurethereisn'tanythingembarrassinghiddeninthemiddleoftext.AlltheLoremIpsumgeneratorsontheInternettendtorepeatpredefinedchunksasnecessary,makingthisthefirsttruegeneratorontheInternet.Itusesadictionaryofover200Latinwords,combinedwithahandfulofmodelsentencestructures,togenerateLoremIpsumwhichlooksreasonable.ThegeneratedLoremIpsumisthereforealwaysfreefromrepetition,injectedhumour,ornon-characteristicwordsetc.

# 문제 7: lorem의 값을 -(하이픈)을 기준으로 나누어라

In [69]:
lorem.split('-')

["There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don't look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn't anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non",
 'characteristic words etc.']

# 문제 8: 100 < x < 806 범위 안에서, x가 홀수일 때 x의 합을 구하라

In [226]:
sum = 0
for i in range(101,806,2):
    sum+=i
print('100보다 크고 806보다 작은 홀수의 합 :', sum)

100보다 크고 806보다 작은 홀수의 합 : 159909

# 문제 9: lorem2를 짝수 줄만 출력하라

In [22]:
lorem2 = '''Contrary to popular belief, Lorem Ipsum is not simply random text. 
It has roots in a piece of classical Latin literature from 45 BC, 
making it over 2000 years old. Richard McClintock, a Latin 
professor at Hampden-Sydney College in Virginia, looked up one of 
the more obscure Latin words, consectetur, from a Lorem Ipsum 
passage, and going through the cites of the word in classical 
literature, discovered the undoubtable source. Lorem Ipsum 
omes from sections 1.10.32 and 1.10.33 of "de Finibus Bonorum 
et Malorum" (The Extremes of Good and Evil) by Cicero, written in 45 BC. 
This book is a treatise on the theory of ethics, very popular during 
the Renaissance. The first line of Lorem Ipsum, "Lorem ipsum dolor sit 
amet..", comes from a line in section 1.10.32.'''

In [24]:
lo2split = lorem2.split('\n')

In [27]:
for i in lo2split[1::2]:
    print(i)

It has roots in a piece of classical Latin literature from 45 BC,
professor at Hampden-Sydney College in Virginia, looked up one of
passage, and going through the cites of the word in classical
omes from sections 1.10.32 and 1.10.33 of "de Finibus Bonorum
This book is a treatise on the theory of ethics, very popular during
amet..", comes from a line in section 1.10.32.

# 문제 10: pdm에서 통계사업번호를 20230116으로 변경해 pdm2로 저장하라

In [100]:
pdm = {"통계사업번호" : "2015140319032",
		"사업명" : "캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)",
		"PDM수직단계" : "summary",
		"PDM목차번호" : "0",
		"PDM목차세부번호" : "1",
		"PDM성과지표" : "개요",
		"연차" : "",
		"내용" : "※대표 수혜자 지표(지표명\/측정 성과): 현재 자조모임 회원 가입 수\/ 총 4,279명"}

In [104]:
pdm2 = pdm["통계사업번호"] = "20230116"

In [105]:
print(pdm2)

20230116

# 문제 11: pdm의 value를 차례대로 출력하라

In [228]:
pdm.values()

dict_values(['20230116', '캄보디아 노인자조모임 지원 및 연합회 설립을 통한 캄보디아 노인의 빈곤퇴치와 건강증진 (2015-20171,037백만원CPP한국헬프에이지Phase2)', 'summary', '0', '1', '개요', '', '※대표 수혜자 지표(지표명\\/측정 성과): 현재 자조모임 회원 가입 수\\/ 총 4,279명'])

# 문제 12: gene에서 A의 개수를 출력하라

In [229]:
gene = 'ACAACTATGCATACTATCGGGAACTATCCT'

In [230]:
gene.count('A')

10

# 문제 13: gene에서 ACTAT라는 패턴의 개수를 확인한다

In [231]:
gene.count('ACTAT')

3

# 문제 14: test.csv 파일의 Age의 값에 모두 102를 더해 저장하라

In [32]:
import pandas as pd

In [33]:
df = pd.read_csv('../../Downloads/test.csv',encoding='cp949')

In [34]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [35]:
df2 = df['Age'].apply(lambda x: x+102)

In [36]:
print(df2)

0      136.5
1      149.0
2      164.0
3      129.0
4      124.0
       ...
413      NaN
414    141.0
415    140.5
416      NaN
417      NaN
Name: Age, Length: 418, dtype: float64

# 문제 15: test.csv 파일의 Sex를 아래와 같이 분류해 저장하라

In [37]:
df3 =df['Sex'].apply(lambda x: x == 'female')

In [38]:
print(df3)

0      False
1       True
2      False
3      False
4       True
       ...
413    False
414     True
415    False
416    False
417    False
Name: Sex, Length: 418, dtype: bool

In [39]:
def to_int(x):
    try: 
        if df3 == True:
            return 1
        else :
            return 0
    except:
        return 0

In [40]:
df['Sex'] = df['Sex'].apply(lambda x: to_int(x))

In [41]:
print(df['Sex'])

0      0
1      0
2      0
3      0
4      0
      ..
413    0
414    0
415    0
416    0
417    0
Name: Sex, Length: 418, dtype: int64

# 문제 16: test.csv 파일에서 Fare의 평균값을 구한 뒤, 평균 이상인 그룹만 분리해 fare_high column에 저장하라

In [242]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,C

In [42]:
dfmean = df['Fare'].mean()

In [43]:
print(dfmean)

35.627188489208635

In [44]:
def func1():
    if df["Fare"] > dfmean :
        return

In [45]:
df["fare_high"] = df['Fare'] > dfmean

In [46]:
df["fare_high"]

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414     True
415    False
416    False
417    False
Name: fare_high, Length: 418, dtype: bool

In [49]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fare_high
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q,False
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,False
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q,False
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S,False
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,False
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,S,False
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,C,True
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,False
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,S,False
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,C,False

# - 문제 17: Passengerid가 아래와 같은 사람의 이름을 출력하라
    - 901, 925, 950, 951, 952, 1026, 1028, 1039, 1040, 1106

In [54]:
df.ioc[[901, 925, 950, 951, 952, 1026, 1028, 1039, 1040, 1106]]

AttributeError: 'DataFrame' object has no attribute 'ioc'

In [51]:
df.index = df['PassengerId']

In [55]:
df.index

Int64Index([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,
            ...
            1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
           dtype='int64', name='PassengerId', length=418)

In [53]:
df.loc[[901, 925, 950, 951, 952, 1026, 1028, 1039, 1040, 1106]]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fare_high
PassengerId,,,,,,,,,,,,
901,901,3,"Davies, Mr. John Samuel",0,21.0,2,0,A/4 48871,24.1500,NaN,S,False
925,925,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",0,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
950,950,3,"Davison, Mr. Thomas Henry",0,NaN,1,0,386525,16.1000,NaN,S,False
951,951,1,"Chaudanson, Miss. Victorine",0,36.0,0,0,PC 17608,262.3750,B61,C,True
952,952,3,"Dika, Mr. Mirko",0,17.0,0,0,349232,7.8958,NaN,S,False
1026,1026,3,"Dintcheff, Mr. Valtcho",0,43.0,0,0,349226,7.8958,NaN,S,False
1028,1028,3,"Zakarian, Mr. Mapriededer",0,26.5,0,0,2656,7.2250,NaN,C,False
1039,1039,3,"Davies, Mr. Evan",0,22.0,0,0,SC/A4 23568,8.0500,NaN,S,False
1040,1040,1,"Crafton, Mr. John Bertram",0,NaN,0,0,113791,26.5500,NaN,S,False
1106,1106,3,"Andersson, Miss. Ida Augusta Margareta",0,38.0,4,2,347091,7.7750,NaN,S,False

# 문제 18: SibSp가 0인 그룹과 1 이상인 그룹 사이에 Fare의 차이가 있는지 통계적으로 확인하라

In [249]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fare_high
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q,<function func1 at 0x000002C51B85F760>
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,<function func1 at 0x000002C51B85F760>
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q,<function func1 at 0x000002C51B85F760>
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S,<function func1 at 0x000002C51B85F760>
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,<function func1 at 0x000002C51B85F760>
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,S,<function func1 at 0x000002C51B85F760>
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,C,<function func1 at 0x000002C51B85F760>
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,<function func1 at 0x000002C51B85F760>
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,S,<function func1 at 0x000002C51B85F760>
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,C,<function func1 at 0x000002C51B85F760>

In [250]:
df["SibSp"]

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    0
415    0
416    0
417    1
Name: SibSp, Length: 418, dtype: int64

# 문제 19: test.csv 파일에서 숫자 데이터로 이루어진 column과 문자 데이터로 이루어진 column을 서로 분리하는 함수를 작성하라

# 문제 20: Age가 짝수인 경우 1, 홀수인 경우 0으로 반환하는 함수를 작성하라

In [251]:
df["Age"]

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [221]:
def age_chk(x):
    if x % 2 ==1:
        return '0'
    elif x % 2 == 0:
        return '1'
    else : 
        return float('nan')

<function age1 at 0x000002C51B85F880>